[net]
width=256
height=256
channels=3

[convolutional]
batch_normalize=1
filters=8
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=2
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=4
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
size=1
stride=1
pad=1
filters=14
activation=linear

[yolo]
mask=2,3
anchors=1,2, 3,4, 5,6, 9,10
classes=2
iou_loss=giou
scale_x_y=1.05
cls_normalizer=1.0
iou_normalizer=0.07
ignore_thresh=0.7

[route]
layers = -4

[upsample]
stride=2

[convolutional]
size=1
stride=1
pad=1
filters=14
activation=linear

[yolo]
mask=0,1
anchors=1,2, 3,4, 5,6, 9,10
classes=2
iou_loss=giou
scale_x_y=1.05
cls_normalizer=1.0
iou_normalizer=0.07
ignore_thresh=0.7
